[
    {
        "id":27205,
        "overview":"Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \"inception\", the implantation of another person's idea into a target's subconscious.",
        "revenue":825532764,
        "title":"Inception",
        "poster_path":"\/oYuLEt3zVCKq57qu2F8dT7NIa6f.jpg"
    },
    {
        "id":157336,
        "overview":"The adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.",
        "revenue":701729206,
        "title":"Interstellar",
        "poster_path":"\/gEU2QniE6E77NI6lCU6MxlNBvIx.jpg"
    },
    {
        "id":155,
        "overview":"Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
        "revenue":1004558444,
        "title":"The Dark Knight",
        "poster_path":"\/qJ2tW6WMUDux911r6m7haRef0WH.jpg"
    },
    {
        "id":19995,
        "overview":"In the 22nd century, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecting an alien civilization.",
        "revenue":2923706026,
        "title":"Avatar",
        "poster_path":"\/kyeqWdyUXW608qlYkRqosgbbJyK.jpg"
    },
    {
        "id":24428,
        "overview":"When an unexpected enemy emerges and threatens global safety and security, Nick Fury, director of the international peacekeeping agency known as S.H.I.E.L.D., finds himself in need of a team to pull the world back from the brink of disaster. Spanning the globe, a daring recruitment effort begins!",
        "revenue":1518815515,
        "title":"The Avengers",
        "poster_path":"\/RYMX2wcKCBAr24UyPD7xwmjaTn.jpg"
    },
    {
        "id":293660,
        "overview":"The origin story of former Special Forces operative turned mercenary Wade Wilson, who, after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life.",
        "revenue":783100000,
        "title":"Deadpool",
        "poster_path":"\/zq8Cl3PNIDGU3iWNRoc5nEZ6pCe.jpg"
    },
    {
        "id":299536,
        "overview":"As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain.",
        "revenue":2052415039,
        "title":"Avengers: Infinity War",
        "poster_path":"\/7WsyChQLEftFiDOVTGkv3hFpyyt.jpg"
    },
    {
        "id":550,
        "overview":"A ticking-time-bomb insomniac and a slippery soap salesman channel primal male aggression into a shocking new form of therapy. Their concept catches on, with underground \"fight clubs\" forming in every town, until an eccentric gets in the way and ignites an out-of-control spiral toward oblivion.",
        "revenue":100853753,
        "title":"Fight Club",
        "poster_path":"\/pB8BM7pdSp6B6Ih7QZ4DrQ3PmJK.jpg"
    },
    {
        "id":118340,
        "overview":"Light years from Earth, 26 years after being abducted, Peter Quill finds himself the prime target of a manhunt after discovering an orb wanted by Ronan the Accuser.",
        "revenue":772776600,
        "title":"Guardians of the Galaxy",
        "poster_path":"\/r7vmZjiyZw9rpJMQJdXpjgiCOk9.jpg"
    },
    {
        "id":680,
        "overview":"A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime caper. Their adventures unfurl in three stories that ingeniously trip back and forth in time.",
        "revenue":213900000,
        "title":"Pulp Fiction",
        "poster_path":"\/d5iIlFn5s0ImszYzBPb8JPIfbXD.jpg"
    },
    {
        "id":13,
        "overview":"A man with a low IQ has accomplished great things in his life and been present during significant historic events—in each case, far exceeding what anyone imagined he could do. But despite all he has achieved, his one true love eludes him.",
        "revenue":677387716,
        "title":"Forrest Gump",
        "poster_path":"\/arw2vcBveWOVZr6pxd9XTd1TdQa.jpg"
    },
    {
        "id":671,
        "overview":"Harry Potter has lived under the stairs at his aunt and uncle's house his whole life. But on his 11th birthday, he learns he's a powerful wizard—with a place waiting for him at the Hogwarts School of Witchcraft and Wizardry. As he learns to harness his newfound powers with the help of the school's kindly headmaster, Harry uncovers the truth about his parents' deaths—and about the villain who's to blame.",
        "revenue":976475550,
        "title":"Harry Potter and the Philosopher's Stone",
        "poster_path":"\/wuMc08IPKEatf9rnMNXvIDxqP4W.jpg"
    },
    {
        "id":1726,
        "overview":"After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil.",
        "revenue":585174222,
        "title":"Iron Man",
        "poster_path":"\/78lPtwv72eTNqFW9COBYI0dWDJa.jpg"
    },
    {
        "id":68718,
        "overview":"With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.",
        "revenue":425368238,
        "title":"Django Unchained",
        "poster_path":"\/7oWY8VDWW7thTzWh3OKYRkWUlD5.jpg"
    },
    {
        "id":299534,
        "overview":"After the devastating events of Avengers: Infinity War, the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos' actions and restore order to the universe once and for all, no matter what consequences may be in store.",
        "revenue":2800000000,
        "title":"Avengers: Endgame",
        "poster_path":"\/or06FN3Dka5tukK1e9sl16pB3iy.jpg"
    },
    {
        "id":603,
        "overview":"Set in the 22nd century, The Matrix tells the story of a computer hacker who joins a group of underground insurgents fighting the vast and powerful computers who now rule the earth.",
        "revenue":463517383,
        "title":"The Matrix",
        "poster_path":"\/f89U3ADr1oiB1s9GkdPOEpXUk5H.jpg"
    },
    {
        "id":597,
        "overview":"101-year-old Rose DeWitt Bukater tells the story of her life aboard the Titanic, 84 years later. A young Rose boards the ship with her mother and fiancé. Meanwhile, Jack Dawson and Fabrizio De Rossi win third-class tickets aboard the ship. Rose tells the whole story from Titanic's departure through to its death—on its first and last voyage—on April 15, 1912.",
        "revenue":2264162353,
        "title":"Titanic",
        "poster_path":"\/9xjZS2rlVxm8SFx8kPC3aIGCOYQ.jpg"
    },
    {
        "id":475557,
        "overview":"During the 1980s, a failed stand-up comedian is driven insane and turns to a life of crime and chaos in Gotham City while becoming an infamous psychopathic crime figure.",
        "revenue":1074458282,
        "title":"Joker",
        "poster_path":"\/udDclJoHjfjb8Ekgsd4FDteOkCU.jpg"
    },
    {
        "id":120,
        "overview":"Young hobbit Frodo Baggins, after inheriting a mysterious ring from his uncle Bilbo, must leave his home in order to keep it from falling into the hands of its evil creator. Along the way, a fellowship is formed to protect the ringbearer and make sure that the ring arrives at its final destination: Mt. Doom, the only place where it can be destroyed.",
        "revenue":871368364,
        "title":"The Lord of the Rings: The Fellowship of the Ring",
        "poster_path":"\/6oom5QYQ2yQTMJIbnvbkBL9cHo6.jpg"
    },
    {
        "id":122,
        "overview":"Aragorn is revealed as the heir to the ancient kings as he, Gandalf and the other members of the broken fellowship struggle to save Gondor from Sauron's forces. Meanwhile, Frodo and Sam take the ring closer to the heart of Mordor, the dark lord's realm.",
        "revenue":1118888979,
        "title":"The Lord of the Rings: The Return of the King",
        "poster_path":"\/rCzpDGLbOoPwLjy3OAm5NUPOTrC.jpg"
    },
    {
        "id":11324,
        "overview":"World War II soldier-turned-U.S. Marshal Teddy Daniels investigates the disappearance of a patient from a hospital for the criminally insane, but his efforts are compromised by troubling visions and a mysterious doctor.",
        "revenue":294800000,
        "title":"Shutter Island",
        "poster_path":"\/4GDy0PHYX3VRXUtwK5ysFbg3kEx.jpg"
    },
    {
        "id":106646,
        "overview":"A New York stockbroker refuses to cooperate in a large securities fraud case involving corruption on Wall Street, corporate banking world and mob infiltration. Based on Jordan Belfort's autobiography.",
        "revenue":392000000,
        "title":"The Wolf of Wall Street",
        "poster_path":"\/34m2tygAYBGqA9MXKhRDtzYd4MR.jpg"
    },
    {
        "id":99861,
        "overview":"When Tony Stark tries to jumpstart a dormant peacekeeping program, things go awry and Earth’s Mightiest Heroes are put to the ultimate test as the fate of the planet hangs in the balance. As the villainous Ultron emerges, it is up to The Avengers to stop him from enacting his terrible plans, and soon uneasy alliances and unexpected action pave the way for an epic and unique global adventure.",
        "revenue":1405403694,
        "title":"Avengers: Age of Ultron",
        "poster_path":"\/4ssDuvEDkSArWEdyBl2X5EHvYKU.jpg"
    },
    {
        "id":271110,
        "overview":"Following the events of Age of Ultron, the collective governments of the world pass an act designed to regulate all superhuman activity. This polarizes opinion amongst the Avengers, causing two factions to side with Iron Man or Captain America, which causes an epic battle between former allies.",
        "revenue":1155046416,
        "title":"Captain America: Civil War",
        "poster_path":"\/rAGiXaUfPzY7CDEyNKUofk3Kw2e.jpg"
    },
    {
        "id":49026,
        "overview":"Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
        "revenue":1081041287,
        "title":"The Dark Knight Rises",
        "poster_path":"\/hr0L2aueqlP2BYUblTTjmtn0hw4.jpg"
    },
    {
        "id":68721,
        "overview":"When Tony Stark's world is torn apart by a formidable terrorist called the Mandarin, he starts an odyssey of rebuilding and retribution.",
        "revenue":1215577205,
        "title":"Iron Man 3",
        "poster_path":"\/qhPtAc1TKbMPqNvcdXSOn9Bn7hZ.jpg"
    },
    {
        "id":284054,
        "overview":"King T'Challa returns home to the reclusive, technologically advanced African nation of Wakanda to serve as his country's new leader. However, T'Challa soon finds that he is challenged for the throne by factions within his own country as well as without. Using powers reserved to Wakandan kings, T'Challa assumes the Black Panther mantle to join with ex-girlfriend Nakia, the queen-mother, his princess-kid sister, members of the Dora Milaje (the Wakandan 'special forces') and an American secret agent, to prevent Wakanda from being dragged into a world war.",
        "revenue":1349926083,
        "title":"Black Panther",
        "poster_path":"\/uxzzxijgPIY7slzFvMotPv8wjKA.jpg"
    },
    {
        "id":284052,
        "overview":"After his career is destroyed, a brilliant but arrogant surgeon gets a new lease on life when a sorcerer takes him under her wing and trains him to defend the world against evil.",
        "revenue":676343174,
        "title":"Doctor Strange",
        "poster_path":"\/uGBVj3bEbCoZbDjjl9wTxcygko1.jpg"
    },
    {
        "id":76341,
        "overview":"An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and most everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order.",
        "revenue":378858340,
        "title":"Mad Max: Fury Road",
        "poster_path":"\/8tZYtuWezp8JbcsvHYO0O46tFbo.jpg"
    },
    {
        "id":70160,
        "overview":"Every year in the ruins of what was once North America, the nation of Panem forces each of its twelve districts to send a teenage boy and girl to compete in the Hunger Games.  Part twisted entertainment, part government intimidation tactic, the Hunger Games are a nationally televised event in which “Tributes” must fight with one another until one survivor remains.  Pitted against highly-trained Tributes who have prepared for these Games their entire lives, Katniss is forced to rely upon her sharp instincts as well as the mentorship of drunken former victor Haymitch Abernathy.  If she’s ever to return home to District 12, Katniss must make impossible choices in the arena that weigh survival against humanity and life against love. The world will be watching.",
        "revenue":694394724,
        "title":"The Hunger Games",
        "poster_path":"\/yXCbOiVDCxO71zI7cuwBRXdftq8.jpg"
    },
    {
        "id":315635,
        "overview":"Following the events of Captain America: Civil War, Peter Parker, with the help of his mentor Tony Stark, tries to balance his life as an ordinary high school student in Queens, New York City, with fighting crime as his superhero alter ego Spider-Man as a new threat, the Vulture, emerges.",
        "revenue":880166924,
        "title":"Spider-Man: Homecoming",
        "poster_path":"\/c24sv2weTHPsmDa7jEMN0m2P3RT.jpg"
    },
    {
        "id":672,
        "overview":"Cars fly, trees fight back, and a mysterious house-elf comes to warn Harry Potter at the start of his second year at Hogwarts. Adventure and danger await when bloody writing on a wall announces: The Chamber Of Secrets Has Been Opened. To save Hogwarts will require all of Harry, Ron and Hermione’s magical abilities and courage.",
        "revenue":876688482,
        "title":"Harry Potter and the Chamber of Secrets",
        "poster_path":"\/sdEOH0992YZ0QSxgXNIGLq1ToUi.jpg"
    },
    {
        "id":283995,
        "overview":"The Guardians must fight to keep their newfound family together as they unravel the mysteries of Peter Quill's true parentage.",
        "revenue":863756051,
        "title":"Guardians of the Galaxy Vol. 2",
        "poster_path":"\/y4MBh0EjBlMuOzv9axM4qJlmhzz.jpg"
    },
    {
        "id":121,
        "overview":"Frodo and Sam are trekking to Mordor to destroy the One Ring of Power while Gimli, Legolas and Aragorn search for the orc-captured Merry and Pippin. All along, nefarious wizard Saruman awaits the Fellowship members at the Orthanc Tower in Isengard.",
        "revenue":926287400,
        "title":"The Lord of the Rings: The Two Towers",
        "poster_path":"\/5VTN0pR8gcqV3EPUHHfMGnJYN9L.jpg"
    },
    {
        "id":1771,
        "overview":"During World War II, Steve Rogers is a sickly man from Brooklyn who's transformed into super-soldier Captain America to aid in the war effort. Rogers must stop the Red Skull – Adolf Hitler's ruthless head of weaponry, and the leader of an organization that intends to use a mysterious device of untold powers for world domination.",
        "revenue":370569774,
        "title":"Captain America: The First Avenger",
        "poster_path":"\/vSNxAJTlD0r02V9sPYpOjqDZXUK.jpg"
    },
    {
        "id":297761,
        "overview":"From DC Comics comes the Suicide Squad, an antihero team of incarcerated supervillains who act as deniable assets for the United States government, undertaking high-risk black ops missions in exchange for commuted prison sentences.",
        "revenue":746846894,
        "title":"Suicide Squad",
        "poster_path":"\/xFw9RXKZDvevAGocgBK0zteto4U.jpg"
    },
    {
        "id":673,
        "overview":"Year three at Hogwarts means new fun and challenges as Harry learns the delicate art of approaching a Hippogriff, transforming shape-shifting Boggarts into hilarity and even turning back time. But the term also brings danger: soul-sucking Dementors hover over the school, an ally of the accursed He-Who-Cannot-Be-Named lurks within the castle walls, and fearsome wizard Sirius Black escapes Azkaban. And Harry will confront them all.",
        "revenue":789804554,
        "title":"Harry Potter and the Prisoner of Azkaban",
        "poster_path":"\/aWxwnYoe8p2d2fcxOqtvAtJ72Rw.jpg"
    },
    {
        "id":10195,
        "overview":"Against his father Odin's will, The Mighty Thor - a powerful but arrogant warrior god - recklessly reignites an ancient war. Thor is cast down to Earth and forced to live among humans as punishment. Once here, Thor learns what it takes to be a true hero when the most dangerous villain of his world sends the darkest forces of Asgard to invade Earth.",
        "revenue":449326618,
        "title":"Thor",
        "poster_path":"\/prSfAi1xGrhLQNxVSUFh61xQ4Qy.jpg"
    },
    {
        "id":10138,
        "overview":"With the world now aware of his dual life as the armored superhero Iron Man, billionaire inventor Tony Stark faces pressure from the government, the press and the public to share his technology with the military. Unwilling to let go of his invention, Stark, with Pepper Potts and James 'Rhodey' Rhodes at his side, must forge new alliances – and confront powerful enemies.",
        "revenue":623933331,
        "title":"Iron Man 2",
        "poster_path":"\/6WBeq4fCfn7AN0o21W9qNcRF2l9.jpg"
    },
    {
        "id":272,
        "overview":"Driven by tragedy, billionaire Bruce Wayne dedicates his life to uncovering and defeating the corruption that plagues his home, Gotham City.  Unable to work within the system, he instead creates a new identity, a symbol of fear for the criminal underworld - The Batman.",
        "revenue":374218673,
        "title":"Batman Begins",
        "poster_path":"\/4MpN4kIEqUjW8OPtOQJXlTdHiJV.jpg"
    },
    {
        "id":284053,
        "overview":"Thor is imprisoned on the other side of the universe and finds himself in a race against time to get back to Asgard to stop Ragnarok, the destruction of his home-world and the end of Asgardian civilization, at the hands of a powerful new threat, the ruthless Hela.",
        "revenue":855301806,
        "title":"Thor: Ragnarok",
        "poster_path":"\/rzRwTcFvttcN1ZpX2xv4j3tSdJu.jpg"
    },
    {
        "id":150540,
        "overview":"Growing up can be a bumpy road, and it's no exception for Riley, who is uprooted from her Midwest life when her father starts a new job in San Francisco. Riley's guiding emotions— Joy, Fear, Anger, Disgust and Sadness—live in Headquarters, the control centre inside Riley's mind, where they help advise her through everyday life and tries to keep things positive, but the emotions conflict on how best to navigate a new city, house and school.",
        "revenue":857611174,
        "title":"Inside Out",
        "poster_path":"\/2H1TmgdfNtsKlU9jKdeNyYL5y8T.jpg"
    },
    {
        "id":135397,
        "overview":"Twenty-two years after the events of Jurassic Park, Isla Nublar now features a fully functioning dinosaur theme park, Jurassic World, as originally envisioned by John Hammond.",
        "revenue":1671537444,
        "title":"Jurassic World",
        "poster_path":"\/A0LZHXUzo5C60Oahvt7VxvwuzHw.jpg"
    },
    {
        "id":807,
        "overview":"Two homicide detectives are on a desperate hunt for a serial killer whose crimes are based on the \"seven deadly sins\" in this dark and haunting film that takes viewers from the tortured remains of one victim to the next. The seasoned Det. Sommerset researches each sin in an effort to get inside the killer's mind, while his novice partner, Mills, scoffs at his efforts to unravel the case.",
        "revenue":327311859,
        "title":"Se7en",
        "poster_path":"\/6yoghtyTpznpBik8EngEmJskVUO.jpg"
    },
    {
        "id":674,
        "overview":"When Harry Potter's name emerges from the Goblet of Fire, he becomes a competitor in a grueling battle for glory among three wizarding schools—the Triwizard Tournament. But since Harry never submitted his name for the Tournament, who did? Now Harry must confront a deadly dragon, fierce water demons and an enchanted maze only to find himself in the cruel grasp of He Who Must Not Be Named.",
        "revenue":895921036,
        "title":"Harry Potter and the Goblet of Fire",
        "poster_path":"\/fECBtHlr0RB3foNHDiCBXeg9Bv9.jpg"
    },
    {
        "id":22,
        "overview":"Jack Sparrow, a freewheeling 18th-century pirate, quarrels with a rival pirate bent on pillaging Port Royal. When the governor's daughter is kidnapped, Sparrow decides to help the girl's love save her.",
        "revenue":655011224,
        "title":"Pirates of the Caribbean: The Curse of the Black Pearl",
        "poster_path":"\/z8onk7LV9Mmw6zKz4hT6pzzvmvl.jpg"
    },
    {
        "id":12445,
        "overview":"Harry, Ron and Hermione continue their quest to vanquish the evil Voldemort once and for all. Just as things begin to look hopeless for the young wizards, Harry discovers a trio of magical objects that endow him with powers to rival Voldemort's formidable skills.",
        "revenue":1341511219,
        "title":"Harry Potter and the Deathly Hallows: Part 2",
        "poster_path":"\/c54HpQmuwXjHq2C9wmoACjxoom3.jpg"
    },
    {
        "id":11,
        "overview":"Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker and dashing captain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.",
        "revenue":775398007,
        "title":"Star Wars",
        "poster_path":"\/6FfCtAuVAW8XJjZ7eWeLibRLWTw.jpg"
    },
    {
        "id":297762,
        "overview":"An Amazon princess comes to the world of Man in the grips of the First World War to confront the forces of evil and bring an end to human conflict.",
        "revenue":822854286,
        "title":"Wonder Woman",
        "poster_path":"\/imekS7f1OuHyUP2LAiTEM0zBzUz.jpg"
    },
    {
        "id":14160,
        "overview":"Carl Fredricksen spent his entire life dreaming of exploring the globe and experiencing life to its fullest. But at age 78, life seems to have passed him by, until a twist of fate (and a persistent 8-year old Wilderness Explorer named Russell) gives him a new lease on life.",
        "revenue":735099082,
        "title":"Up",
        "poster_path":"\/vpbaStTMt8qqXaEgnOR2EE4DNJk.jpg"
    },
    {
        "id":102899,
        "overview":"Armed with the astonishing ability to shrink in scale but increase in strength, master thief Scott Lang must embrace his inner-hero and help his mentor, Doctor Hank Pym, protect the secret behind his spectacular Ant-Man suit from a new generation of towering threats. Against seemingly insurmountable obstacles, Pym and Lang must plan and pull off a heist that will save the world.",
        "revenue":519311965,
        "title":"Ant-Man",
        "poster_path":"\/8YxOIPrabqkQCOKKbuxaz9IcqhO.jpg"
    },
    {
        "id":238,
        "overview":"Spanning the years 1945 to 1955, a chronicle of the fictional Italian-American Corleone crime family. When organized crime family patriarch, Vito Corleone barely survives an attempt on his life, his youngest son, Michael steps in to take care of the would-be killers, launching a campaign of bloody revenge.",
        "revenue":245066411,
        "title":"The Godfather",
        "poster_path":"\/3bhkrj58Vtu7enYsRolD1fZdja1.jpg"
    },
    {
        "id":286217,
        "overview":"During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive.",
        "revenue":630600000,
        "title":"The Martian",
        "poster_path":"\/5BHuvQ6p9kfc091Z8RiFNhCwL4b.jpg"
    },
    {
        "id":105,
        "overview":"Eighties teenager Marty McFly is accidentally sent back in time to 1955, inadvertently disrupting his parents' first meeting and attracting his mother's romantic interest. Marty must repair the damage to history by rekindling his parents' romance and - with the help of his eccentric inventor friend Doc Brown - return to 1985.",
        "revenue":381109762,
        "title":"Back to the Future",
        "poster_path":"\/fNOH9f1aA7XRTzl1sAOx9iF553Q.jpg"
    },
    {
        "id":140607,
        "overview":"Thirty years after defeating the Galactic Empire, Han Solo and his allies face a new threat from the evil Kylo Ren and his army of Stormtroopers.",
        "revenue":2068223624,
        "title":"Star Wars: The Force Awakens",
        "poster_path":"\/wqnLdwVXoBjKibFRR5U3y0aDUhs.jpg"
    },
    {
        "id":634649,
        "overview":"Peter Parker is unmasked and no longer able to separate his normal life from the high-stakes of being a super-hero. When he asks for help from Doctor Strange the stakes become even more dangerous, forcing him to discover what it truly means to be Spider-Man.",
        "revenue":1921847111,
        "title":"Spider-Man: No Way Home",
        "poster_path":"\/5weKu49pzJCt06OPpjvT80efnQj.jpg"
    },
    {
        "id":675,
        "overview":"Returning for his fifth year of study at Hogwarts, Harry is stunned to find that his warnings about the return of Lord Voldemort have been ignored. Left with no choice, Harry takes matters into his own hands, training a small group of students to defend themselves against the dark arts.",
        "revenue":938212738,
        "title":"Harry Potter and the Order of the Phoenix",
        "poster_path":"\/5aOyriWkPec0zUDxmHFP9qMmBaj.jpg"
    },
    {
        "id":767,
        "overview":"As Lord Voldemort tightens his grip on both the Muggle and wizarding worlds, Hogwarts is no longer a safe haven. Harry suspects perils may even lie within the castle, but Dumbledore is more intent upon preparing him for the final battle fast approaching. Together they work to find the key to unlock Voldemorts defenses and to this end, Dumbledore recruits his old friend and colleague Horace Slughorn, whom he believes holds crucial information. Even as the decisive showdown looms, romance blossoms for Harry, Ron, Hermione and their classmates. Love is in the air, but danger lies ahead and Hogwarts may never be the same again.",
        "revenue":933959197,
        "title":"Harry Potter and the Half-Blood Prince",
        "poster_path":"\/z7uo9zmQdQwU5ZJHFpv2Upl30i1.jpg"
    },
    {
        "id":263115,
        "overview":"In the near future, a weary Logan cares for an ailing Professor X in a hideout on the Mexican border. But Logan's attempts to hide from the world and his legacy are upended when a young mutant arrives, pursued by dark forces.",
        "revenue":619021436,
        "title":"Logan",
        "poster_path":"\/fnbjcRDYn6YviCcePDnGdyAkYsB.jpg"
    },
    {
        "id":12,
        "overview":"Nemo, an adventurous young clownfish, is unexpectedly taken from his Great Barrier Reef home to a dentist's office aquarium. It's up to his worrisome father Marlin and a friendly but forgetful fish Dory to bring Nemo home -- meeting vegetarian sharks, surfer dude turtles, hypnotic jellyfish, hungry seagulls, and more along the way.",
        "revenue":940335536,
        "title":"Finding Nemo",
        "poster_path":"\/ggQ6o8X5984OCh3kZi2UIJQJY5y.jpg"
    },
    {
        "id":346364,
        "overview":"In a small town in Maine, seven children known as The Losers Club come face to face with life problems, bullies and a monster that takes the shape of a clown called Pennywise.",
        "revenue":701800000,
        "title":"It",
        "poster_path":"\/9E2y5Q7WlCVNEhP5GiVTjhEhx1o.jpg"
    },
    {
        "id":245891,
        "overview":"Ex-hitman John Wick comes out of retirement to track down the gangsters that took everything from him.",
        "revenue":88761661,
        "title":"John Wick",
        "poster_path":"\/fZPSd91yGE9fCcCe6OoQr6E3Bev.jpg"
    },
    {
        "id":259316,
        "overview":"In 1926, Newt Scamander arrives at the Magical Congress of the United States of America with a magically expanded briefcase, which houses a number of dangerous creatures and their habitats. When the creatures escape from the briefcase, it sends the American wizarding authorities after Newt, and threatens to strain even further the state of magical and non-magical relations.",
        "revenue":809342332,
        "title":"Fantastic Beasts and Where to Find Them",
        "poster_path":"\/h6NYfVUyM6CDURtZSnBpz647Ldd.jpg"
    },
    {
        "id":12444,
        "overview":"Harry, Ron and Hermione walk away from their last year at Hogwarts to find and destroy the remaining Horcruxes, putting an end to Voldemort's bid for immortality. But with Harry's beloved Dumbledore dead and Voldemort's unscrupulous Death Eaters on the loose, the world is more dangerous than ever.",
        "revenue":954305868,
        "title":"Harry Potter and the Deathly Hallows: Part 1",
        "poster_path":"\/iGoXIpQb7Pot00EEdwpwPajheZ5.jpg"
    },
    {
        "id":354912,
        "overview":"Despite his family’s baffling generations-old ban on music, Miguel dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz. Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector, and together, they set off on an extraordinary journey to unlock the real story behind Miguel's family history.",
        "revenue":800526015,
        "title":"Coco",
        "poster_path":"\/gGEsBPAijhVUFoiNpgZXqRVWJt2.jpg"
    },
    {
        "id":100402,
        "overview":"After the cataclysmic events in New York with The Avengers, Steve Rogers, aka Captain America is living quietly in Washington, D.C. and trying to adjust to the modern world. But when a S.H.I.E.L.D. colleague comes under attack, Steve becomes embroiled in a web of intrigue that threatens to put the world at risk. Joining forces with the Black Widow, Captain America struggles to expose the ever-widening conspiracy while fighting off professional assassins sent to silence him at every turn. When the full scope of the villainous plot is revealed, Captain America and the Black Widow enlist the help of a new ally, the Falcon. However, they soon find themselves up against an unexpected and formidable enemy—the Winter Soldier.",
        "revenue":714766572,
        "title":"Captain America: The Winter Soldier",
        "poster_path":"\/tVFRpFw3xTedgPGqxW0AOI8Qhh0.jpg"
    },
    {
        "id":557,
        "overview":"After being bitten by a genetically altered spider at Oscorp, nerdy but endearing high school student Peter Parker is endowed with amazing powers to become the superhero known as Spider-Man.",
        "revenue":821708551,
        "title":"Spider-Man",
        "poster_path":"\/gh4cZbhZxyTbgxQPxD0dOudNPTn.jpg"
    },
    {
        "id":10681,
        "overview":"What if mankind had to leave Earth and somebody forgot to turn the last robot off? After hundreds of years doing what he was built for, WALL•E discovers a new purpose in life when he meets a sleek search robot named EVE. EVE comes to realize that WALL•E has inadvertently stumbled upon the key to the planet's future, and races back to space to report to the humans. Meanwhile, WALL•E chases EVE across the galaxy and sets into motion one of the most imaginative adventures ever brought to the big screen.",
        "revenue":521311860,
        "title":"WALL·E",
        "poster_path":"\/hbhFnRzzg6ZDmm8YAmxBnQpQIPh.jpg"
    },
    {
        "id":210577,
        "overview":"With his wife's disappearance having become the focus of an intense media circus, a man sees the spotlight turned on him when it's suspected that he may not be innocent.",
        "revenue":369330363,
        "title":"Gone Girl",
        "poster_path":"\/qymaJhucquUwjpb8oiqynMeXnID.jpg"
    },
    {
        "id":49051,
        "overview":"Bilbo Baggins, a hobbit enjoying his quiet life, is swept into an epic quest by Gandalf the Grey and thirteen dwarves who seek to reclaim their mountain home from Smaug, the dragon.",
        "revenue":1021103568,
        "title":"The Hobbit: An Unexpected Journey",
        "poster_path":"\/yHA9Fc37VmpUA5UncTxxo3rTGVA.jpg"
    },
    {
        "id":585,
        "overview":"Lovable Sulley and his wisecracking sidekick Mike Wazowski are the top scare team at Monsters, Inc., the scream-processing factory in Monstropolis. When a little girl named Boo wanders into their world, it's the monsters who are scared silly, and it's up to Sulley and Mike to keep her out of sight and get her back home.",
        "revenue":579707738,
        "title":"Monsters, Inc.",
        "poster_path":"\/sgheSKxZkttIe8ONsf2sWXPgip3.jpg"
    },
    {
        "id":862,
        "overview":"Led by Woody, Andy's toys live happily in his room until Andy's birthday brings Buzz Lightyear onto the scene. Afraid of losing his place in Andy's heart, Woody plots against Buzz. But when circumstances separate Buzz and Woody from their owner, the duo eventually learns to put aside their differences.",
        "revenue":394400000,
        "title":"Toy Story",
        "poster_path":"\/uXDfjJbdP4ijW5hWSBrPrlKpxab.jpg"
    },
    {
        "id":281957,
        "overview":"In the 1820s, a frontiersman, Hugh Glass, sets out on a path of vengeance against those who left him for dead after a bear mauling.",
        "revenue":532950503,
        "title":"The Revenant",
        "poster_path":"\/ji3ecJphATlVgWNY0B0RVXZizdf.jpg"
    },
    {
        "id":209112,
        "overview":"Fearing the actions of a god-like Super Hero left unchecked, Gotham City’s own formidable, forceful vigilante takes on Metropolis’s most revered, modern-day savior, while the world wrestles with what sort of hero it really needs. And with Batman and Superman at war with one another, a new threat quickly arises, putting mankind in greater danger than it’s ever known before.",
        "revenue":873637528,
        "title":"Batman v Superman: Dawn of Justice",
        "poster_path":"\/5UsK3grJvtQrtzEgqNlDljJW96w.jpg"
    },
    {
        "id":8587,
        "overview":"A young lion prince is cast out of his pride by his cruel uncle, who claims he killed his father. While the uncle rules with an iron paw, the prince grows up beyond the Savannah, living by a philosophy: No worries for the rest of your days. But when his past comes to haunt him, the young prince must decide his fate: Will he remain an outcast or face his demons and become what he needs to be?",
        "revenue":763455561,
        "title":"The Lion King",
        "poster_path":"\/sKCr78MXSLixwmZ8DyJLrpMsd15.jpg"
    },
    {
        "id":9806,
        "overview":"Bob Parr has given up his superhero days to log in time as an insurance adjuster and raise his three children with his formerly heroic wife in suburbia. But when he receives a mysterious assignment, it's time to get back into costume.",
        "revenue":631442092,
        "title":"The Incredibles",
        "poster_path":"\/2LqaLgk4Z226KkgPJuiOQ58wvrm.jpg"
    },
    {
        "id":329865,
        "overview":"Taking place after alien crafts land around the world, an expert linguist is recruited by the military to determine whether they come in peace or are a threat.",
        "revenue":203388186,
        "title":"Arrival",
        "poster_path":"\/x2FJsf1ElAgr63Y3PNPtJrcmpoe.jpg"
    },
    {
        "id":496243,
        "overview":"All unemployed, Ki-taek's family takes peculiar interest in the wealthy and glamorous Parks for their livelihood until they get entangled in an unexpected incident.",
        "revenue":257591776,
        "title":"Parasite",
        "poster_path":"\/7IiTTgloJzvGI1TAYymCfbfl3vT.jpg"
    },
    {
        "id":76338,
        "overview":"Thor fights to restore order across the cosmos… but an ancient race led by the vengeful Malekith returns to plunge the universe back into darkness. Faced with an enemy that even Odin and Asgard cannot withstand, Thor must embark on his most perilous and personal journey yet, one that will reunite him with Jane Foster and force him to sacrifice everything to save us all.",
        "revenue":644783140,
        "title":"Thor: The Dark World",
        "poster_path":"\/wp6OxE4poJ4G7c0U2ZIXasTSMR7.jpg"
    },
    {
        "id":1930,
        "overview":"Peter Parker is an outcast high schooler abandoned by his parents as a boy, leaving him to be raised by his Uncle Ben and Aunt May. Like most teenagers, Peter is trying to figure out who he is and how he got to be the person he is today. As Peter discovers a mysterious briefcase that belonged to his father, he begins a quest to understand his parents' disappearance – leading him directly to Oscorp and the lab of Dr. Curt Connors, his father's former partner. As Spider-Man is set on a collision course with Connors' alter ego, The Lizard, Peter will make life-altering choices to use his powers and shape his destiny to become a hero.",
        "revenue":757930663,
        "title":"The Amazing Spider-Man",
        "poster_path":"\/jIfkQNARYyERqRAq1p1c8xgePp4.jpg"
    },
    {
        "id":381288,
        "overview":"Though Kevin has evidenced 23 personalities to his trusted psychiatrist, Dr. Fletcher, there remains one still submerged who is set to materialize and dominate all the others. Compelled to abduct three teenage girls led by the willful, observant Casey, Kevin reaches a war for survival among all of those contained within him — as well as everyone around him — as the walls between his compartments shatter apart.",
        "revenue":278454358,
        "title":"Split",
        "poster_path":"\/lli31lYTFpvxVBeFHWoe5PMfW5s.jpg"
    },
    {
        "id":383498,
        "overview":"Wisecracking mercenary Deadpool battles the evil and powerful Cable and other bad guys to save a boy's life.",
        "revenue":785896609,
        "title":"Deadpool 2",
        "poster_path":"\/to0spRl1CMDvyUbOnbb4fTk3VAd.jpg"
    },
    {
        "id":24,
        "overview":"An assassin is shot by her ruthless employer, Bill, and other members of their assassination circle – but she lives to plot her vengeance.",
        "revenue":180906076,
        "title":"Kill Bill: Vol. 1",
        "poster_path":"\/v7TaX8kXMXs5yFFGR41guUDNcnB.jpg"
    },
    {
        "id":101299,
        "overview":"Katniss Everdeen has returned home safe after winning the 74th Annual Hunger Games along with fellow tribute Peeta Mellark. Winning means that they must turn around and leave their family and close friends, embarking on a \"Victor's Tour\" of the districts. Along the way Katniss senses that a rebellion is simmering, but the Capitol is still very much in control as President Snow prepares the 75th Annual Hunger Games (The Quarter Quell) - a competition that could change Panem forever.",
        "revenue":865011746,
        "title":"The Hunger Games: Catching Fire",
        "poster_path":"\/vrQHDXjVmbYzadOXQ0UaObunoy2.jpg"
    },
    {
        "id":419430,
        "overview":"Chris and his girlfriend Rose go upstate to visit her parents for the weekend. At first, Chris reads the family's overly accommodating behavior as nervous attempts to deal with their daughter's interracial relationship, but as the weekend progresses, a series of increasingly disturbing discoveries lead him to a truth that he never could have imagined.",
        "revenue":255407969,
        "title":"Get Out",
        "poster_path":"\/mE24wUCfjK8AoBBjaMjho7Rczr7.jpg"
    },
    {
        "id":424694,
        "overview":"Singer Freddie Mercury, guitarist Brian May, drummer Roger Taylor and bass guitarist John Deacon take the music world by storm when they form the rock 'n' roll band Queen in 1970. Hit songs become instant classics. When Mercury's increasingly wild lifestyle starts to spiral out of control, Queen soon faces its greatest challenge yet – finding a way to keep the band together amid the success and excess.",
        "revenue":903992901,
        "title":"Bohemian Rhapsody",
        "poster_path":"\/lHu1wtNaczFPGFDTrjCSzeLPTKN.jpg"
    },
    {
        "id":497,
        "overview":"A supernatural tale set on death row in a Southern prison, where gentle giant John Coffey possesses the mysterious power to heal people's ailments. When the cell block's head guard, Paul Edgecomb, recognizes Coffey's miraculous gift, he tries desperately to help stave off the condemned man's execution.",
        "revenue":286801374,
        "title":"The Green Mile",
        "poster_path":"\/8VG8fDNiy50H4FedGwdSVUPoaJe.jpg"
    },
    {
        "id":198663,
        "overview":"Set in a post-apocalyptic world, young Thomas is deposited in a community of boys after his memory is erased, soon learning they're all trapped in a maze that will require him to join forces with fellow “runners” for a shot at escape.",
        "revenue":348319861,
        "title":"The Maze Runner",
        "poster_path":"\/ode14q7WtDugFDp78fo9lCsmay9.jpg"
    },
    {
        "id":18785,
        "overview":"When three friends finally come to after a raucous night of bachelor-party revelry, they find a baby in the closet and a tiger in the bathroom. But they can't seem to locate their best friend, Doug – who's supposed to be tying the knot. Launching a frantic search for Doug, the trio perseveres through a nasty hangover to try to make it to the church on time.",
        "revenue":469310836,
        "title":"The Hangover",
        "poster_path":"\/uluhlXubGu1VxU63X9VHCLWDAYP.jpg"
    },
    {
        "id":1891,
        "overview":"The epic saga continues as Luke Skywalker, in hopes of defeating the evil Galactic Empire, learns the ways of the Jedi from aging master Yoda. But Darth Vader is more determined than ever to capture Luke. Meanwhile, rebel leader Princess Leia, cocky Han Solo, Chewbacca, and droids C-3PO and R2-D2 are thrown into various stages of capture, betrayal and despair.",
        "revenue":538400000,
        "title":"The Empire Strikes Back",
        "poster_path":"\/nNAeTmF4CtdSgMDplXTDPOpYzsX.jpg"
    },
    {
        "id":808,
        "overview":"It ain't easy bein' green -- especially if you're a likable (albeit smelly) ogre named Shrek. On a mission to retrieve a gorgeous princess from the clutches of a fire-breathing dragon, Shrek teams up with an unlikely compatriot -- a wisecracking donkey.",
        "revenue":487853320,
        "title":"Shrek",
        "poster_path":"\/dyhaB19AICF7TO7CK2aD6KfymnQ.jpg"
    },
    {
        "id":2062,
        "overview":"Remy, a resident of Paris, appreciates good food and has quite a sophisticated palate. He would love to become a chef so he can create and enjoy culinary masterpieces to his heart's delight. The only problem is, Remy is a rat. When he winds up in the sewer beneath one of Paris' finest restaurants, the rodent gourmet finds himself ideally placed to realize his dream.",
        "revenue":623726000,
        "title":"Ratatouille",
        "poster_path":"\/t3vaWRPSf6WjDSamIkKDs1iQWna.jpg"
    },
    {
        "id":207703,
        "overview":"The story of a super-secret spy organization that recruits an unrefined but promising street kid into the agency's ultra-competitive training program just as a global threat emerges from a twisted tech genius.",
        "revenue":414351546,
        "title":"Kingsman: The Secret Service",
        "poster_path":"\/ay7xwXn1G9fzX9TUBlkGA584rGi.jpg"
    },
    {
        "id":313369,
        "overview":"Mia, an aspiring actress, serves lattes to movie stars in between auditions and Sebastian, a jazz musician, scrapes by playing cocktail party gigs in dingy bars, but as success mounts they are faced with decisions that begin to fray the fragile fabric of their love affair, and the dreams they worked so hard to maintain in each other threaten to rip them apart.",
        "revenue":447407695,
        "title":"La La Land",
        "poster_path":"\/uDO8zWDhfWwoFdKS4fzkUJt0Rf0.jpg"
    },
    {
        "id":109445,
        "overview":"Young princess Anna of Arendelle dreams about finding true love at her sister Elsa’s coronation. Fate takes her on a dangerous journey in an attempt to end the eternal winter that has fallen over the kingdom. She's accompanied by ice delivery man Kristoff, his reindeer Sven, and snowman Olaf. On an adventure where she will find out what friendship, courage, family, and true love really means.",
        "revenue":1274219009,
        "title":"Frozen",
        "poster_path":"\/kgwjIb2JDHRhNk13lmSxiClFjVk.jpg"
    },
    {
        "id":374720,
        "overview":"The story of the miraculous evacuation of Allied soldiers from Belgium, Britain, Canada and France, who were cut off and surrounded by the German army from the beaches and harbour of Dunkirk between May 26th and June 4th 1940 during World War II.",
        "revenue":527000000,
        "title":"Dunkirk",
        "poster_path":"\/b4Oe15CGLL61Ped0RAS9JpqdmCt.jpg"
    },
    {
        "id":269149,
        "overview":"Determined to prove herself, Officer Judy Hopps, the first bunny on Zootopia's police force, jumps at the chance to crack her first case - even if it means partnering with scam-artist fox Nick Wilde to solve the mystery.",
        "revenue":1023784195,
        "title":"Zootopia",
        "poster_path":"\/hlK0e0wAQ3VLuJcsfIYPvb4JVud.jpg"
    },
    {
        "id":240832,
        "overview":"A woman, accidentally caught in a dark deal, turns the tables on her captors and transforms into a merciless warrior evolved beyond human logic.",
        "revenue":458863600,
        "title":"Lucy",
        "poster_path":"\/dhjyfcwEoW6jJ4Q7DpZTp6E58GA.jpg"
    },
    {
        "id":329,
        "overview":"A wealthy entrepreneur secretly creates a theme park featuring living dinosaurs drawn from prehistoric DNA. Before opening day, he invites a team of experts and his two eager grandchildren to experience the park and help calm anxious investors. However, the park is anything but amusing as the security systems go off-line and the dinosaurs escape.",
        "revenue":920100000,
        "title":"Jurassic Park",
        "poster_path":"\/oU7Oq2kFAAlGqbU4VoAE36g4hoI.jpg"
    },
    {
        "id":321612,
        "overview":"A live-action adaptation of Disney's version of the classic tale of a cursed prince and a beautiful young woman who helps him break the spell.",
        "revenue":1266115964,
        "title":"Beauty and the Beast",
        "poster_path":"\/hKegSKIDep2ewJWPUQD7u0KqFIp.jpg"
    }
]